Data/Final_Implemented_data/Concurrency/Random/test_rand2.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   4.621 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    21.64 [#/sec] (mean)
Time per request:       462.125 [ms] (mean)
Time per request:       46.212 [ms] (mean, across all concurrent requests)
Transfer rate:          2167.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      106  347  86.1    344     578
Processing:     1   84  77.4     64     247
Waiting:        1   83  76.9     62     244
Total:        129  432 120.7    442     686

Percentage of the requests served within a certain time (ms)
  50%    442
  66%    492
  75%    512
  80%    534
  90%    588
  95%    636
  98%    681
  99%    686
 100%    686 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      20
Time taken for tests:   3.966 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    25.21 [#/sec] (mean)
Time per request:       793.192 [ms] (mean)
Time per request:       39.660 [ms] (mean, across all concurrent requests)
Transfer rate:          2526.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       71  531 118.5    497     784
Processing:     2  160 257.9    134    1393
Waiting:        1  158 257.8    133    1392
Total:        104  691 256.0    657    1887

Percentage of the requests served within a certain time (ms)
  50%    657
  66%    689
  75%    736
  80%    740
  90%    814
  95%   1003
  98%   1867
  99%   1887
 100%   1887 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)...Total of 96 requests completed